tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendTargetValue(const WaterRecord& record) {
    if (record.mode == WaterMode::Time) {
        sendFmt("%lu 秒", static_cast<unsigned long>(record.targetValue));
        return;
    }
    sendLiters(record.targetValue);
}

bool waterRecordCanCalibrate(const WaterRecord& record) {
    return record.pulseCount > 0 &&
           (record.result == WaterResult::Completed || record.result == WaterResult::StoppedByUser);
}

void sendMetricCard(const char* label, const char* value) {
    Esp32BaseWeb::sendChunk("<section class='metric-card'><span>");
    Esp32BaseWeb::sendChunk(label);
    Esp32BaseWeb::sendChunk("</span><strong>");
    Esp32BaseWeb::sendChunk(value);
    Esp32BaseWeb::sendChunk("</strong></section>");
}

void formatDurationShort(std::uint32_t seconds, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (seconds >= 3600UL) {
        std::snprintf(out, len, "%luh %lum", static_cast<unsigned long>(seconds / 3600UL),
                      static_cast<unsigned long>((seconds / 60UL) % 60UL));
    } else if (seconds >= 60UL) {
        std::snprintf(out, len, "%lum %lus", static_cast<unsigned long>(seconds / 60UL),
                      static_cast<unsigned long>(seconds % 60UL));
    } else {
        std::snprintf(out, len, "%lus", static_cast<unsigned long>(seconds));
    }
}

std::uint32_t percentOf(std::uint32_t value, std::uint32_t total) {
    if (total == 0) {
        return 0;
    }
    const std::uint64_t percent = (static_cast<std::uint64_t>(value) * 100ULL) / total;
    return percent > 100ULL ? 100UL : static_cast<std::uint32_t>(percent);
}

void sendStatBar(const char* label, const char* value, std::uint32_t percent) {
    sendFmt("<div class='stat-bar'><div class='stat-bar-head'><span>%s</span><strong>%s</strong></div>"
            "<div class='progress'><span style='width:%lu%%'></span></div></div>",
            label,
            value,
            static_cast<unsigned long>(percent));
}

void addSaturating(std::uint32_t& target, std::uint32_t value) {
    const std::uint32_t max = UINT32_MAX;
    target = max - target < value ? max : target + value;
}

std::uint32_t sumRealRecordVolumeSince(std::uint32_t startTime) {
    if (!g_context.records || !g_context.records->ready() || startTime < kMinRealDateSeconds) {
        return 0;
    }
    std::uint32_t total = 0;
    WaterRecord* records = new (std::nothrow) WaterRecord[kMaxRecordPageSize]{};
    if (!records) {
        return 0;
    }
    const std::size_t count = g_context.records->count();
    for (std::size_t offset = 0; offset < count; offset += kMaxRecordPageSize) {
        const std::size_t page = offset / kMaxRecordPageSize;
        const std::size_t read = g_context.records->readPage(page, kMaxRecordPageSize, records, kMaxRecordPageSize);
        if (read == 0) {
            break;
        }
        for (std::size_t i = 0; i < read; ++i) {
            if (waterRecordHasRealTime(records[i]) && records[i].startTime >= startTime && records[i].volumeMl > 0) {
                addSaturating(total, records[i].volumeMl);
            }
        }
    }
    delete[] records;
    return total;
}

void sendDailyChart(const WaterUsageSummary& summary) {
    std::uint32_t maxVolume = 0;
    std::uint32_t maxDuration = 0;
    for (std::size_t i = 0; i < summary.dayCount; ++i) {
        if (summary.days[i].volumeMl > maxVolume) {
            maxVolume = summary.days[i].volumeMl;
        }
        if (summary.days[i].durationSec > maxDuration) {
            maxDuration = summary.days[i].durationSec;
        }
    }
    Esp32BaseWeb::sendChunk("<section class='daily-chart'><div class='chart-head'><h3>最近 30 天</h3>"
                            "<span class='chart-key volume-key'>出水量</span><span class='chart-key duration-key'>出水时长</span></div>"
                            "<p class='hint'>上下两图共用日期轴，灰色短线表示当天无记录。</p>"
                            "<svg viewBox='0 0 1000 210' role='img' aria-label='最近30天每日出水量和出水时长'>");
    constexpr std::uint32_t volumeTop = 14;
    constexpr std::uint32_t durationTop = 114;
    constexpr std::uint32_t chartHeight = 58;
    constexpr std::uint32_t volumeBaseY = volumeTop + chartHeight;
    constexpr std::uint32_t durationBaseY = durationTop + chartHeight;
    constexpr std::uint32_t left = 46;
    constexpr std::uint32_t step = 31;
    constexpr std::uint32_t barWidth = 14;
    char maxText[24]{};
    formatLiters(maxVolume, maxText, sizeof(maxText));
    char maxDurationText[24]{};
    formatDurationShort(maxDuration, maxDurationText, sizeof(maxDurationText));
    Esp32BaseWeb::sendChunk("<line class='axis' x1='40' y1='72' x2='975' y2='72'></line>");
    sendFmt("<text class='y-label' x='38' y='12'>%s</text>", maxText);
    for (std::size_t i = 0; i < summary.dayCount; ++i) {
        const std::uint32_t x = left + static_cast<std::uint32_t>(i) * step;
        const DailyUsageBucket& day = summary.days[i];
        const std::uint32_t barHeight = maxVolume == 0 ? 0 : (day.volumeMl * chartHeight) / maxVolume;
        const std::uint32_t y = volumeBaseY - barHeight;
        char volume[24]{};
        formatLiters(day.volumeMl, volume, sizeof(volume));
        char duration[24]{};
        formatDurationShort(day.durationSec, duration, sizeof(duration));
        const std::uint32_t avgMl = day.count == 0 ? 0 : day.volumeMl / day.count;
        sendFmt("<rect class='%s' x='%lu' y='%lu' width='%lu' height='%lu'><title>",
                day.count == 0 ? "bar empty-bar" : "bar",
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(barHeight == 0 ? volumeBaseY - 2 : y),
                static_cast<unsigned long>(barWidth),
                static_cast<unsigned long>(barHeight == 0 ? 2 : barHeight));
        char label[8]{};
        formatDayLabel(day.dayIndex, label, sizeof(label));
        sendFmt("%s：%s · %s · %u 次 · 平均 %lu ml/次</title></rect>",
                label,
                volume,
                duration,
                static_cast<unsigned>(day.count),
                static_cast<unsigned long>(avgMl));
    }
    Esp32BaseWeb::sendChunk("<line class='axis' x1='40' y1='172' x2='975' y2='172'></line>");
    sendFmt("<text class='y-label' x='38' y='112'>%s</text>", maxDurationText);
    for (std::size_t i = 0; i < summary.dayCount; ++i) {
        const std::uint32_t x = left + static_cast<std::uint32_t>(i) * step;
        const DailyUsageBucket& day = summary.days[i];
        const std::uint32_t barHeight = maxDuration == 0 ? 0 : (day.durationSec * chartHeight) / maxDuration;
        const std::uint32_t y = durationBaseY - barHeight;
        char label[8]{};
        char duration[24]{};
        formatDayLabel(day.dayIndex, label, sizeof(label));
        formatDurationShort(day.durationSec, duration, sizeof(duration));
        sendFmt("<rect class='%s' x='%lu' y='%lu' width='%lu' height='%lu'><title>%s：%s · %u 次</title></rect>",
                day.count == 0 ? "duration-bar empty-bar" : "duration-bar",
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(barHeight == 0 ? durationBaseY - 2 : y),
                static_cast<unsigned long>(barWidth),
                static_cast<unsigned long>(barHeight == 0 ? 2 : barHeight),
                label,
                duration,
                static_cast<unsigned>(day.count));
        if (i % 5 == 0 || i + 1 == summary.dayCount) {
            sendFmt("<text class='x-label' x='%lu' y='204'>%s</text>",
                    static_cast<unsigned long>(x + barWidth / 2),
                    label);
        }
    }
    Esp32BaseWeb::sendChunk("</svg></section>");
}

void sendTimeUnsyncedChartNotice() {
    Esp32BaseWeb::sendChunk("<section class='daily-chart'><h3>最近 30 天出水量</h3>"
                            "<p class='hint'>时间未同步，暂不生成按真实日期统计的图表；同步后会自动显示今日往前 30 天。</p>"
                            "</section>");
}

