tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendDateInput(const char* label, const char* name, std::uint32_t seconds) {
    char date[16]{};
    formatDate(seconds >= kMinRealDateSeconds ? seconds : 0, date, sizeof(date));
    sendFmt("<label class='field'><span>%s</span><input type='date' name='%s' value='%s'></label>",
            label,
            name,
            date);
}

void sendCheckbox(const char* label, const char* name, bool checked) {
    sendFmt("<label class='check-field'><span class='check-title'>%s</span><span class='check-line'><input type='checkbox' name='%s' value='1'%s>启用</span></label>",
            label,
            name,
            checked ? " checked" : "");
}

void formatMonthRange(const WaterUsageSummary& summary, char* out, std::size_t len) {
    if (!out || len == 0 || summary.monthStartDay == 0 || summary.todayDay == 0) {
        return;
    }
    std::uint16_t year = 0;
    std::uint8_t month = 0;
    std::uint8_t day = 0;
    dateFromDayIndex(summary.monthStartDay, year, month, day);
    std::uint16_t endYear = 0;
    std::uint8_t endMonth = 0;
    std::uint8_t endDay = 0;
    dateFromDayIndex(summary.todayDay, endYear, endMonth, endDay);
    std::snprintf(out,
                  len,
                  "%u 月 %u ~ %u 日",
                  static_cast<unsigned>(month),
                  static_cast<unsigned>(day),
                  static_cast<unsigned>(endDay));
}

std::uint32_t maxCountVolume(const CountVolumeBucket* buckets, std::size_t count) {
    std::uint32_t max = 0;
    for (std::size_t i = 0; i < count; ++i) {
        if (buckets[i].volumeMl > max) {
            max = buckets[i].volumeMl;
        }
    }
    return max;
}

std::uint32_t maxResultCount(const std::uint32_t* values, std::size_t count) {
    std::uint32_t max = 0;
    for (std::size_t i = 0; i < count; ++i) {
        if (values[i] > max) {
            max = values[i];
        }
    }
    return max;
}

void sendUsageBar(const char* label, std::uint32_t volumeMl, std::uint32_t count, std::uint32_t maxVolume) {
    char volume[24]{};
    formatLiters(volumeMl, volume, sizeof(volume));
    const std::uint32_t percent = maxVolume == 0 ? 0 : (volumeMl * 100UL) / maxVolume;
    sendFmt("<div class='usage-row'><span>%s</span><strong>%s · %lu 次</strong>"
            "<div class='usage-bar'><i style='width:%lu%%'></i></div></div>",
            label,
            volume,
            static_cast<unsigned long>(count),
            static_cast<unsigned long>(percent));
}

void sendCountBar(const char* label, std::uint32_t count, std::uint32_t maxCount) {
    const std::uint32_t percent = maxCount == 0 ? 0 : (count * 100UL) / maxCount;
    sendFmt("<div class='usage-row'><span>%s</span><strong>%lu 次</strong>"
            "<div class='usage-bar'><i style='width:%lu%%'></i></div></div>",
            label,
            static_cast<unsigned long>(count),
            static_cast<unsigned long>(percent));
}

const char* resultLabel(std::size_t index) {
    switch (static_cast<WaterResult>(index)) {
        case WaterResult::Completed:
            return "正常完成";
        case WaterResult::StoppedByUser:
            return "用户停止";
        case WaterResult::SafetyStopped:
            return "安全停止";
        case WaterResult::FlowError:
            return "流量异常";
        case WaterResult::PauseTimeout:
            return "暂停超时";
    }
    return "未知";
}

void sendUsagePatterns(const WaterUsageSummary& summary, const SystemConfig& config) {
    Esp32BaseWeb::sendChunk("<section class='usage-panel'><h3>按预设分布</h3>");
    const std::uint32_t maxPreset = maxCountVolume(summary.presetCounts, kPresetCount);
    for (std::size_t i = 0; i < kPresetCount; ++i) {
        if (summary.presetCounts[i].count == 0) {
            continue;
        }
        char label[40]{};
        char name[kPresetNameLength]{};
        std::strncpy(name, config.presets[i].name, sizeof(name) - 1);
        std::snprintf(label, sizeof(label), "%u %s", static_cast<unsigned>(i + 1), name);
        sendUsageBar(label, summary.presetCounts[i].volumeMl, summary.presetCounts[i].count, maxPreset);
    }
    if (maxPreset == 0) {
        Esp32BaseWeb::sendChunk("<p class='hint'>最近 30 天没有可聚合的真实时间记录。</p>");
    }
    Esp32BaseWeb::sendChunk("</section><section class='usage-panel'><h3>按时段分布</h3>");
    CountVolumeBucket timeRanges[6]{};
    static constexpr const char* rangeLabels[6] = {"深夜", "早晨", "上午", "中午", "下午", "晚上"};
    for (std::size_t h = 0; h < 24; ++h) {
        const std::size_t index = h < 6 ? 0 : h < 9 ? 1 : h < 12 ? 2 : h < 14 ? 3 : h < 18 ? 4 : 5;
        addSaturating(timeRanges[index].volumeMl, summary.hourBuckets[h].volumeMl);
        if (timeRanges[index].count <= UINT16_MAX - summary.hourBuckets[h].count) {
            timeRanges[index].count = static_cast<std::uint16_t>(timeRanges[index].count + summary.hourBuckets[h].count);
        } else {
            timeRanges[index].count = UINT16_MAX;
        }
    }
    const std::uint32_t maxTime = maxCountVolume(timeRanges, 6);
    for (std::size_t i = 0; i < 6; ++i) {
        sendUsageBar(rangeLabels[i], timeRanges[i].volumeMl, timeRanges[i].count, maxTime);
    }
    Esp32BaseWeb::sendChunk("</section><section class='usage-panel'><h3>完成结果</h3>");
    const std::uint32_t maxResult = maxResultCount(summary.resultCounts, kUsageResultCount);
    for (std::size_t i = 0; i < kUsageResultCount; ++i) {
        sendCountBar(resultLabel(i), summary.resultCounts[i], maxResult);
    }
    Esp32BaseWeb::sendChunk("</section><section class='usage-panel'><h3>单次出水分布</h3>");
    static constexpr const char* histLabels[kUsageVolumeHistCount] = {"<100 ml", "100-300 ml", "300-500 ml", "500-1000 ml", ">1000 ml"};
    const std::uint32_t maxHist = maxCountVolume(summary.volumeHist, kUsageVolumeHistCount);
    for (std::size_t i = 0; i < kUsageVolumeHistCount; ++i) {
        sendUsageBar(histLabels[i], summary.volumeHist[i].volumeMl, summary.volumeHist[i].count, maxHist);
    }
    Esp32BaseWeb::sendChunk("</section>");
}

void sendFilterCards(std::uint32_t now) {
    Esp32BaseWeb::sendChunk("<h2>滤芯</h2><div class='filter-cards'>");
    std::uint32_t usedDaysByIndex[kFilterCount]{};
    std::size_t enabledCount = 0;
    for (std::size_t i = 0; i < kFilterCount; ++i) {
        const FilterRecord& filter = g_context.filters->record(i);
        if (!filter.enabled) {
            continue;
        }
        usedDaysByIndex[i] = filter.startTime >= kMinRealDateSeconds ? g_context.filters->usedDays(i, now) : 0;
        ++enabledCount;
    }
    for (std::size_t i = 0; i < kFilterCount; ++i) {
        const FilterRecord& filter = g_context.filters->record(i);
        if (!filter.enabled) {
            continue;
        }
        const std::uint32_t usedDays = usedDaysByIndex[i];
        const std::uint32_t dayProgress = filterProgressPercent(filter, usedDays);
        const std::uint32_t flowProgress = filterFlowProgressPercent(filter);
        char usedFlow[24]{};
        char lifeFlow[24]{};
        char startDate[16]{};
        formatLiters(filter.usedMl, usedFlow, sizeof(usedFlow));
        formatLiters(filter.lifeMl, lifeFlow, sizeof(lifeFlow));
        formatDate(filter.startTime, startDate, sizeof(startDate));

        Esp32BaseWeb::sendChunk("<section class='filter-card'><div class='filter-head'><strong>");
        sendHtmlEscapedBounded(filter.name, sizeof(filter.name));
        sendFmt("</strong><span class='status-pill'>%s</span></div>"
                "<div class='dual-progress'><span class='day-progress' style='width:%lu%%'></span>"
                "<span class='flow-progress' style='width:%lu%%'></span></div>",
                filterDisplayStatusText(filter, usedDays),
                static_cast<unsigned long>(dayProgress),
                static_cast<unsigned long>(flowProgress));
        Esp32BaseWeb::sendChunk("<div class='filter-meta'>");
        if (filter.recommendDays > 0) {
            sendFmt("<span>已用 %lu 天 / 上限 %lu 天</span>",
                    static_cast<unsigned long>(usedDays),
                    static_cast<unsigned long>(filter.recommendDays));
        } else {
            sendFmt("<span>已用 %lu 天 / 未设置天数</span>", static_cast<unsigned long>(usedDays));
        }
        sendFmt("<span>已用 %s / 寿命 %s</span><span>上次更换 %s</span></div></section>",
                usedFlow,
                filter.lifeMl == 0 ? "未设置" : lifeFlow,
                startDate[0] ? startDate : "未设置");
    }
    if (enabledCount == 0) {
        Esp32BaseWeb::sendChunk("<section class='filter-card muted'>当前没有启用的滤芯。</section>");
    }
    Esp32BaseWeb::sendChunk("</div>");
}

void handleFaucetPage() {
    if (!sendPageStart("出水龙头")) {
        return;
    }
    if (!requireContext()) {
        sendPageEnd();
        return;
    }
    const AppSnapshot snapshot = g_context.app->snapshot();
    char currentPreset[16]{};
    std::snprintf(currentPreset, sizeof(currentPreset), "%u", static_cast<unsigned>(snapshot.water.selectedPreset + 1));
    char targetValue[24]{};
    if (snapshot.water.mode == WaterMode::Time) {
        std::snprintf(targetValue, sizeof(targetValue), "%lu 秒", static_cast<unsigned long>(snapshot.water.targetValue));
    } else {
        formatLiters(snapshot.water.targetValue, targetValue, sizeof(targetValue));
    }
    char today[24]{};
    char month[24]{};
    char total[24]{};
    formatLiters(snapshot.statistics.todayMl, today, sizeof(today));
    formatLiters(snapshot.statistics.monthMl, month, sizeof(month));
    formatLiters(snapshot.statistics.totalMl, total, sizeof(total));

